acl
acorn
acpi
adobe-source-code-pro-fonts
adobe-source-han-mono-cn-fonts
adobe-source-han-sans-cn-fonts
adobe-source-han-serif-cn-fonts
adwaita-icon-theme
alacritty
alsa-card-profiles
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
android-file-transfer
annie
aom
archlinux-keyring
archlinuxcn-keyring
argon2
aria2
aspell
aspell-en
at-spi2-atk
at-spi2-core
atk
atkmm
atool
attr
audit
autoconf
automake
avahi
bandwhich
banner
base
bash
bash-completion
bash-language-server
bat
bbswitch
bc
binutils
bison
blas
bluez
bluez-libs
bluez-utils
boost-libs
botan
bottom
brave-bin
breeze-gtk
bridge-utils
brotli
btrfs-progs
bubblewrap
bumblebee
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
calibre
cantarell-fonts
capitaine-cursors
capnproto
catdoc
cblas
ccls
cdparanoia
celt
chafa
chmlib
cifs-utils
clang
clash
clipgrab
cmake
compiler-rt
confuse
containerd
copyq
coreutils
cowsay
cpanminus
cpdf
cryptsetup
cscope
ctags
cuda
cudnn
curl
curlie
dav1d
db
dbus
dbus-glib
dbus-python
dconf
deno
desktop-file-utils
device-mapper
diffutils
djvulibre
dmraid
dnssec-anchors
docker
docx2txt
dos2unix
dosfstools
double-conversion
drawio-desktop-bin
dstat
dtc
duf
dunst
dust
e2fsprogs
ed
edk2-ovmf
efibootmgr
efivar
egl-wayland
eglexternalplatform
electron14
elfutils
enchant
entr
exa
exiv2
expat
fakeroot
fcitx5
fcitx5-configtool
fcitx5-gtk
fcitx5-pinyin-moegirl-rime
fcitx5-pinyin-zhwiki-rime
fcitx5-qt
fcitx5-rime
fd
ffmpeg
ffmpegthumbnailer
fftw
figlet
file
filesystem
filezilla
findutils
firefox
flac
flameshot
flex
fluidsynth
fmt
fontconfig
fortune-mod
freeglut
freeimage
freetype2
fribidi
fuse-common
fuse2
fuse3
fzf
fzy
gawk
gc
gcc
gcc-libs
gcolor2
gconf
gcr
gd
gdb
gdb-common
gdb-dashboard
gdbm
gdk-pixbuf2
geoclue
geocode-glib
geogebra
geoip
geoip-database
gettext
gflags
ghc-libs
ghostscript
giflib
girara
git
git-lfs
glew
glib-networking
glib2
glibc
glibmm
glslang
glu
gmp
gnome-keyring
gnupg
gnutls
go
gobject-introspection-runtime
goldendict
google-glog
gopls
gpgme
gpm
gptfdisk
graphene
graphite
grep
groff
grub
gsettings-desktop-schemas
gsfonts
gsm
gst-plugins-base
gst-plugins-base-libs
gstreamer
gtk-update-icon-cache
gtk2
gtk3
gtkmm3
gtksourceview3
guile
gumbo-parser
gvfs
gvim
gzip
harfbuzz
harfbuzz-icu
haskell-aeson
haskell-aeson-pretty
haskell-ansi-terminal
haskell-appar
haskell-asn1-encoding
haskell-asn1-parse
haskell-asn1-types
haskell-assoc
haskell-async
haskell-attoparsec
haskell-base-compat
haskell-base-compat-batteries
haskell-base-orphans
haskell-base16-bytestring
haskell-base64-bytestring
haskell-basement
haskell-bifunctors
haskell-blaze-builder
haskell-blaze-html
haskell-blaze-markup
haskell-byteable
haskell-byteorder
haskell-case-insensitive
haskell-cereal
haskell-citeproc
haskell-cmdargs
haskell-colour
haskell-commonmark
haskell-commonmark-extensions
haskell-commonmark-pandoc
haskell-comonad
haskell-conduit
haskell-conduit-extra
haskell-connection
haskell-cookie
haskell-cryptonite
haskell-data-default
haskell-data-default-class
haskell-data-default-instances-containers
haskell-data-default-instances-dlist
haskell-data-default-instances-old-locale
haskell-data-fix
haskell-diff
haskell-digest
haskell-distributive
haskell-dlist
haskell-doclayout
haskell-doctemplates
haskell-emojis
haskell-erf
haskell-errors
haskell-file-embed
haskell-glob
haskell-haddock-library
haskell-hashable
haskell-hourglass
haskell-hslua
haskell-hslua-module-path
haskell-hslua-module-system
haskell-hslua-module-text
haskell-hsyaml
haskell-http
haskell-http-client
haskell-http-client-tls
haskell-http-types
haskell-indexed-traversable
haskell-integer-logarithms
haskell-iproute
haskell-ipynb
haskell-jira-wiki-markup
haskell-juicypixels
haskell-memory
haskell-mime-types
haskell-mono-traversable
haskell-network
haskell-network-uri
haskell-old-locale
haskell-old-time
haskell-pandoc-types
haskell-pem
haskell-primitive
haskell-quickcheck
haskell-random
haskell-regex-base
haskell-regex-tdfa
haskell-resourcet
haskell-safe
haskell-scientific
haskell-sha
haskell-skylighting
haskell-skylighting-core
haskell-socks
haskell-split
haskell-splitmix
haskell-streaming-commons
haskell-strict
haskell-syb
haskell-tagged
haskell-tagsoup
haskell-temporary
haskell-texmath
haskell-text-conversions
haskell-text-icu
haskell-th-abstraction
haskell-th-compat
haskell-th-lift
haskell-th-lift-instances
haskell-these
haskell-time-compat
haskell-tls
haskell-transformers-compat
haskell-typed-process
haskell-unicode-collation
haskell-unicode-data
haskell-unicode-transforms
haskell-uniplate
haskell-unliftio-core
haskell-unordered-containers
haskell-utf8-string
haskell-uuid-types
haskell-vector
haskell-vector-algorithms
haskell-x509
haskell-x509-store
haskell-x509-system
haskell-x509-validation
haskell-xml
haskell-xml-conduit
haskell-xml-types
haskell-zip-archive
haskell-zlib
hdparm
hexedit
hexyl
hicolor-icon-theme
hidapi
hspell
htop
http-parser
hugo
hunspell
hunspell-en_us
hwids
hwloc
hyperfine
hyphen
i3-gaps
i3blocks
i3lock
i3status
iana-etc
icu
ijs
imagemagick
imath
imlib2
imv
intel-mkl
intel-ucode
iproute2
iptables-nft
iputils
ipython
iso-codes
jack2
jansson
jasper
java-environment-common
java-runtime-common
jbig2dec
jdk-openjdk
jedi-language-server
jemalloc
jq
jre-openjdk
jre-openjdk-headless
js78
json-c
json-glib
jsoncpp
jupyter
jupyter-nbclassic
jupyter-nbclient
jupyter-nbconvert
jupyter-nbformat
jupyter-notebook
jupyter-server
jupyter-widgetsnbextension
jupyter_console
jupyterlab
jupyterlab_pygments
jxrlib
kbd
kconfig
kcoreaddons
keyutils
kitemviews
kitty
kitty-terminfo
kmod
knotifications
krb5
kvantum-qt5
kwidgetsaddons
kwindowsystem
l-smash
lame
lapack
lcms2
ldb
ldns
less
leveldb
lf
lftp
lib32-gcc-libs
lib32-glibc
libaio
libao
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libavc1394
libavif
libblockdev
libbluray
libbpf
libbsd
libbytesize
libcacard
libcanberra
libcap
libcap-ng
libcddb
libcdio
libcdio-paranoia
libclc
libcloudproviders
libcolord
libcroco
libcups
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdbusmenu-qt5
libdc1394
libde265
libdrm
libdvdnav
libdvdread
libedit
libelf
libepoxy
libev
libevdev
libevent
libexif
libfdk-aac
libffi
libfilezilla
libfm
libfm-extra
libfm-gtk2
libfontenc
libfreeaptx
libgcrypt
libgit2
libglvnd
libgpg-error
libgphoto2
libgudev
libheif
libibus
libical
libice
libid3tag
libidn
libidn2
libiec61883
libimagequant
libindicator-gtk3
libinih
libinput
libinstpatch
libjpeg-turbo
libksba
libldac
libldap
liblqr
libluv
libmanette
libmd
libmediainfo
libmfx
libmicrohttpd
libmm-glib
libmms
libmng
libmnl
libmodplug
libmpc
libmtp
libmysqlclient
libnatspec
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnfs
libnftnl
libnghttp2
libnl
libnm
libnotify
libnsgif
libnsl
libogg
libomxil-bellagio
libp11-kit
libpaper
libpcap
libpciaccess
libpgm
libpipeline
libplacebo
libpng
libproxy
libpsl
libpulse
libqalculate
libqtshadowsocks
libraqm
libraw
libraw1394
libressl
librime
librime-data
librsvg
libsamplerate
libsasl
libseccomp
libsecret
libsigc++
libsigsegv
libslirp
libsm
libsndfile
libsodium
libsoup
libsoup3
libsoxr
libspectre
libssh
libssh2
libstemmer
libsvm
libsynctex
libtasn1
libteam
libtermkey
libthai
libtheora
libtiff
libtirpc
libtool
libtorrent
libunistring
libunrar
libunwind
liburcu
liburing
libusb
libutempter
libuv
libva
libvdpau
libvisual
libvoikko
libvorbis
libvpx
libvterm
libwacom
libwebp
libwmf
libwpe
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdg-basedir
libxdmcp
libxext
libxfixes
libxfont2
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmu
libxpm
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxvmc
libxxf86vm
libyaml
libyuv
libzen
libzip
licenses
linux
linux-api-headers
linux-firmware
llvm
llvm-libs
lm_sensors
lmdb
lolcat
lsb-release
lsof
lua
lua-language-server
lua52
lua53
luajit
lvm2
lxappearance
lxmenu-data
lz4
lzo
m4
magma
mailcap
maim
make
man-db
man-pages
marisa
mathjax
mathjax2
md4c
mdadm
mediainfo
meld
menu-cache
mesa
mesa-demos
minizip
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
mpfr
mpv
msgpack-c
mtdev
mujs
mysql-clients
nccl
ncdu
ncurses
ndctl
neofetch
neovim
nerd-fonts-cascadia-code
nerd-fonts-hack
nerd-fonts-jetbrains-mono
nerd-fonts-source-code-pro
nettle
networkmanager
newsboat
nftables
ninja
node-gyp
nodejs
nodejs-nopt
nomacs
noto-fonts-emoji
npm
npth
nspr
nss
ntfs-3g
numactl
nuspell
nutstore
nvidia
nvidia-utils
ocl-icd
odt2txt
onednn
oniguruma
openal
opencc
opencl-mesa
opencl-nvidia
opencore-amr
opencv
openexr
opengl-man-pages
openjpeg2
openmp
openmpi
openssh
openssl
optipng
opus
orc
os-prober
p11-kit
p7zip
pacman
pacman-contrib
pacman-mirrorlist
pam
pambase
pamixer
pandoc
pango
pangomm
papirus-icon-theme
parted
paru
patch
pavucontrol
pciutils
pcmanfm
pcre
pcre2
perf
perl
perl-encode-locale
perl-error
perl-file-basedir
perl-file-desktopentry
perl-file-mimeinfo
perl-file-which
perl-image-exiftool
perl-ipc-system-simple
perl-mailtools
perl-timedate
perl-uri
phonon-qt5
phonon-qt5-gstreamer
pinentry
pipewire
pixman
pkgconf
plocate
podofo
polkit
poppler
poppler-glib
popt
portaudio
potrace
prettier
procps-ng
procs
protobuf
psmisc
pulseaudio
pulseaudio-alsa
pulseaudio-bluetooth
pulsemixer
pybind11
python
python-anyio
python-appdirs
python-apsw
python-argcomplete
python-argon2_cffi
python-async_generator
python-attrs
python-babel
python-backcall
python-beautifulsoup4
python-black
python-bleach
python-brotlicffi
python-cachecontrol
python-cairo
python-cchardet
python-certifi
python-cffi
python-chardet
python-click
python-colorama
python-commonmark
python-contextlib2
python-cryptography
python-css-parser
python-cssselect
python-cycler
python-d2to1
python-dateutil
python-debugpy
python-decorator
python-defusedxml
python-deprecation
python-distlib
python-distro
python-dnspython
python-docopt
python-docstring-to-markdown
python-docutils
python-entrypoints
python-feedparser
python-fonttools
python-future
python-gobject
python-greenlet
python-html2text
python-html5-parser
python-html5lib
python-idna
python-ifaddr
python-importlib-metadata
python-ipykernel
python-ipywidgets
python-jedi
python-jeepney
python-jinja
python-json5
python-jsonschema
python-jupyter_client
python-jupyter_core
python-jupyter_packaging
python-jupyterlab_server
python-kiwisolver
python-lsp-black
python-lsp-jsonrpc
python-lsp-server
python-lxml
python-markdown
python-markupsafe
python-matplotlib
python-matplotlib-inline
python-mechanize
python-mistune1
python-more-itertools
python-msgpack
python-multivolumefile
python-mutagen
python-mypy_extensions
python-nest_asyncio
python-netifaces
python-numpy
python-ordered-set
python-packaging
python-pandas
python-pandocfilters
python-parso
python-pathspec
python-pep517
python-pexpect
python-pickleshare
python-pillow
python-pip
python-pipx
python-platformdirs
python-pluggy
python-ply
python-progress
python-prometheus_client
python-prompt_toolkit
python-psutil
python-ptyprocess
python-py7zr
python-pybluez
python-pychm
python-pycparser
python-pycryptodome
python-pycryptodomex
python-pydantic
python-pygls
python-pygments
python-pynvim
python-pyopenssl
python-pyparsing
python-pyppmd
python-pyqt5
python-pyqt5-sip
python-pyqt5-webengine
python-pyrsistent
python-pysocks
python-pytorch-cuda
python-pytz
python-pyzmq
python-pyzstd
python-regex
python-requests
python-requests-unixsocket
python-resolvelib
python-retrying
python-rich
python-scipy
python-send2trash
python-setuptools
python-sgmllib3k
python-six
python-sniffio
python-soupsieve
python-terminado
python-testpath
python-texttable
python-toml
python-tomli
python-tomlkit
python-torchvision
python-tornado
python-tqdm
python-traitlets
python-typeguard
python-typing_extensions
python-ujson
python-unrardll
python-urllib3
python-userpath
python-wcwidth
python-webencodings
python-websocket-client
python-websockets
python-wheel
python-xlib
python-yaml
python-zeroconf
python-zipp
qemu
qhull
qrencode
qt5-base
qt5-declarative
qt5-imageformats
qt5-location
qt5-multimedia
qt5-quick3d
qt5-quickcontrols
qt5-quickcontrols2
qt5-script
qt5-sensors
qt5-serialport
qt5-speech
qt5-svg
qt5-tools
qt5-wayland
qt5-webchannel
qt5-webengine
qt5-webkit
qt5-x11extras
qt5-xmlpatterns
qt5ct
qtkeychain-qt5
quazip
rapidjson
rav1e
re2
readline
recode
reflector
rest
rhash
rime-bopomofo
rime-cangjie
rime-essay
rime-luna-pinyin
rime-prelude
rime-stroke
rime-terra-pinyin
ripgrep
rofi
rofi-calc
rsync
rtkit
rubberband
ruby
ruby-diff-lcs
ruby-irb
ruby-manpages
ruby-optimist
ruby-paint
ruby-rainbow
ruby-rdoc
ruby-reline
ruby-rspec
ruby-rspec-core
ruby-rspec-expectations
ruby-rspec-mocks
ruby-rspec-support
ruby-term-ansicolor
ruby-tins
rubygems
run-parts
runc
rust
sbc
sbcl
sc
screenkey
sd
sdl
sdl2
sdl2_image
seabios
sed
semver
shaderc
shadow
shadowsocks
shadowsocks-qt5
shared-mime-info
shellcheck
slang
slop
smbclient
smem
smplayer
snappy
sound-theme-freedesktop
source-highlight
speex
speexdsp
spice
spirv-tools
sqlite
srt
ssfconv
startup-notification
stfl
stow
sudo
svt-av1
sxhkd
sxiv
sysfsutils
sysstat
systemd
systemd-libs
systemd-sysvcompat
t1lib
talloc
tar
tbb
tcl
tdb
tealdeer
terminus-font
tevent
texinfo
texlab
texlive-bibtexextra
texlive-bin
texlive-core
texlive-fontsextra
texlive-formatsextra
texlive-games
texlive-humanities
texlive-langchinese
texlive-latexextra
texlive-music
texlive-pictures
texlive-pstricks
texlive-publishers
texlive-science
thin-provisioning-tools
tig
tinyxml2
tmux
tokei
tracker3
trash-cli
trayer
tree-sitter
tslib
ttf-cascadia-code
ttf-dejavu
ttf-hack
ttf-jetbrains-mono
ttf-joypixels
ttf-liberation
ttf-linux-libertine
ttf-ubuntu-font-family
tzdata
uboot-tools
uchardet
udisks2
ueberzug
unclutter
unibilium
unicode-cldr-annotations
unrar
unzip-natspec
usbredir
util-linux
util-linux-libs
v2ray
v2ray-domain-list-community
v2ray-geoip
v2raya
v4l-utils
valgrind
vamp-plugin-sdk
vde2
vid.stab
vim-runtime
virglrenderer
virtualbox
virtualbox-host-modules-arch
virtualgl
vmaf
volume_key
vscodium-bin
vsftpd
vte-common
vte3
vulkan-icd-loader
wayland
wayland-protocols
webcamoid
webkit2gtk
webrtc-audio-processing
wget
which
wkhtmltopdf
wmctrl
woff2
words
wpa_supplicant
wpebackend-fdo
wxgtk-common
wxgtk3
x11-ssh-askpass
x264
x265
xautolock
xcape
xcb-imdkit
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xclip
xcompmgr
xdg-dbus-proxy
xdg-utils
xdotool
xf86-input-libinput
xf86-video-intel
xf86-video-vesa
xfsprogs
xinetd
xkeyboard-config
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-alias-100dpi
xorg-fonts-alias-75dpi
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-util-macros
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xclock
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xlsfonts
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwayland
xorg-xwd
xorg-xwininfo
xorg-xwud
xorgproto
xournalpp
xsel
xvidcore
xwallpaper
xxhash
xz
yajl
yaml-cpp
yay
you-get
youtube-dl
yt-dlp
zathura
zathura-djvu
zathura-pdf-mupdf
zathura-ps
zbar
zeal-git
zeromq
zimg
zip
zita-alsa-pcmi
zita-resampler
zlib
zotero
zoxide
zsh
zstd
zziplib
