acpi
adobe-source-han-mono-cn-fonts
adobe-source-han-sans-cn-fonts
adobe-source-han-serif-cn-fonts
alacritty
android-file-transfer
annie
archlinuxcn-keyring
aria2
aspell
aspell-en
atool
autoconf
automake
bandwhich
banner
base
bash-completion
bash-language-server
bat
bbswitch
bc
bison
bluez
bluez-utils
bottom
brave-bin
breeze-gtk
bumblebee
calibre
capitaine-cursors
catdoc
ccls
chafa
clash
clipgrab
copyq
cowsay
cpanminus
cpdf
cscope
ctags
curlie
deno
docx2txt
dos2unix
drawio-desktop-bin
dstat
duf
dunst
dust
ed
efibootmgr
entr
exa
fakeroot
fcitx5
fcitx5-configtool
fcitx5-gtk
fcitx5-pinyin-moegirl-rime
fcitx5-pinyin-zhwiki-rime
fcitx5-qt
fcitx5-rime
fd
ffmpegthumbnailer
figlet
filezilla
firefox
flameshot
flex
fortune-mod
fzf
fzy
gcolor2
gdb
gdb-dashboard
geoip
git
git-lfs
github-cli
gnome-keyring
go
goldendict
gopls
grub
gvfs
gvim
hdparm
hexedit
hexyl
hspell
htop
hugo
hunspell-en_us
hyperfine
i3-gaps
i3blocks
i3lock
i3status
imagemagick
imv
intel-ucode
inxi
iptables
ipython
jedi-language-server
jq
jsoncpp
jupyterlab
kitty
kvantum
lf
lftp
lib32-gcc-libs
lib32-glibc
libressl
libsvm
libtorrent
libvoikko
linux
linux-firmware
llvm
lolcat
lua-language-server
lxappearance
lxsession
m4
maim
make
man-db
man-pages
mediainfo
meld
mesa-demos
mpv
mysql-clients
ncdu
neofetch
neovim
nerd-fonts-cascadia-code
nerd-fonts-hack
nerd-fonts-jetbrains-mono
nerd-fonts-source-code-pro
networkmanager
newsboat
ninja
nomacs
noto-fonts-emoji
npm
nuspell
nutstore
nvidia
odt2txt
opengl-man-pages
os-prober
p7zip
pacman-contrib
pamixer
pandoc
papirus-icon-theme
paru
patch
pavucontrol
pcmanfm
perf
perl-file-mimeinfo
perl-image-exiftool
pkgconf
plocate
prettier
procs
pulseaudio-alsa
pulseaudio-bluetooth
pulsemixer
python-certifi
python-d2to1
python-matplotlib
python-pandas
python-pip
python-pipx
python-pybluez
python-pynvim
python-pytorch-cuda
python-rich
python-torchvision
qt5-multimedia
qt5-speech
qt5ct
qt6ct
qtkeychain-qt5
reflector
ripgrep
rofi
rofi-calc
rsync
ruby
rust
sbcl
sc
screenkey
sd
shellcheck
smartmontools
smem
smplayer
ssfconv
stow
sudo
sxhkd
sxiv
sysstat
tcl
tealdeer
terminus-font
texinfo
texlab
texlive-bibtexextra
texlive-core
texlive-fontsextra
texlive-formatsextra
texlive-games
texlive-humanities
texlive-langchinese
texlive-latexextra
texlive-music
texlive-pictures
texlive-pstricks
texlive-publishers
texlive-science
tig
tmux
tokei
trash-cli
trayer
tree-sitter
ttf-cascadia-code
ttf-dejavu
ttf-hack
ttf-jetbrains-mono
ttf-joypixels
ttf-linux-libertine
ttf-ubuntu-font-family
uboot-tools
ueberzug
unclutter
unrar
unzip-natspec
v2ray
v2raya
valgrind
virtualbox
vscodium-bin
vsftpd
webcamoid
webkit2gtk
wget
wkhtmltopdf
wmctrl
words
x11-ssh-askpass
xautolock
xcape
xclip
xcompmgr
xdotool
xf86-input-libinput
xf86-video-intel
xf86-video-vesa
xinetd
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xclock
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xlsfonts
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwayland
xorg-xwd
xorg-xwininfo
xorg-xwud
xournalpp
xsel
xwallpaper
yarn
yay
you-get
youtube-dl
zathura-djvu
zathura-pdf-mupdf
zathura-ps
zeal-git
zip
zotero
zoxide
zsh
